Repository: lt-mayonesa/hexagon
Catalog: locales/*/LC_MESSAGES/hexagon.po
Languages: es

# msg.main.first_time_intro
source: This looks like your first time running hexagon.
es: Esta parece ser tu primera vez ejecutando hexagon.

# msg.main.first_time_tool
source: You should probably run "Install CLI".
es: Probablemente deberías ejecutar "Instalar CLI"

# msg.actions.external.open_link.result
source: Opening URL: {url}
es: Abriendo URL: {url}

# action.actions.internal.create_new_tool.choose_action
source: Choose the action of your tool:
es: Seleccioná la acción que va a tener tu herramienta:

# action.actions.internal.create_new_tool.choose_type
source: What type of tool is it?
es: ¿Cual es el tipo de la herramienta?

# action.actions.internal.create_new_tool.input_name
source: What command would you like to give your tool?
es: ¿Qué comando va a tener tu herramienta?

# action.actions.internal.create_new_tool.input_alias
source: Would you like to add an alias/shortcut? (empty for none)
es: ¿Te gustaría que tenga un alias? (vacío = No)

# action.actions.internal.create_new_tool.input_long_name
source: Would you like to add a long name? (this will be displayed instead of command)
es: ¿Te gustaría agregar un nombre más descriptivo? (va a ser mostrado en lugar del comando)

# action.actions.internal.create_new_tool.input_description
source: Would you like to add a description? (this will be displayed along side command/long_name)
es: ¿Te gustaría agregar una descripción? (va a ser mostrada junto con el nombre/comando)

# action.actions.internal.create_new_tool.input_custom_tools_path
source: Where would you like it to be? (can be absolute path or relative to YAML. ie: ./tools or .)
es: ¿Donde te gustaría que se encuentre? (puede ser un directorio relativo al YAML - ej: ./tools o . - o absoluto)

# action.actions.internal.create_new_tool.input_action
source: What name would you like to give your new action?
es: ¿Qué nombre va a tener tu acción?

# msg.actions.internal.create_new_tool.custom_tools_dir_not_set
source: [magenta]Your CLI does not have a custom tools dir.[/magenta]
es: [magenta]Tu CLI no tiene un directorio de herramientas (cli.custom_tools_dir).[/magenta]

# msg.actions.internal.create_new_tool.input_custom_tools_path_comment
source: relative to this file
es: relativo a este archivo

# action.actions.internal.install_cli.config_file_location
source: Where is your CLI's hexagon config YAML? (app.yml/yaml)
es: ¿Dónde está el YAML de configuración de tu CLI? (*.yml o *.yaml)

# action.actions.internal.install_cli.commands_path
source: Where do you want your CLI commands to be saved? This should be on your path
es: ¿En qué directorio te gustaría que se guarden los comandos de CLI? Debería estar en el PATH de tu SO.

# error.actions.internal.install_cli.select_valid_file
source: Please select a valid YAML file
es: Por favor, selecciona un YAML valido (*.yaml o *.yml)

# msg.actions.internal.install_cli.success
source: [green]✓ [white][u]All done! Now you can execute your project's CLI like:
es: ¡Listo! Ahora podes ejecutar tu CLI de la siguiente manera:

# msg.actions.internal.install_cli.not_in_path
source: [yellow]⚠ {dir} is not in your $PATH[/yellow]
es: [yellow]⚠ {dir} no está en tu $PATH[/yellow]

# action.actions.internal.save_new_alias.prompt_alias_name
source: Alias name?
es: ¿qué alias se quiere usar?

# error.actions.internal.save_new_alias.insert_valid_alias
source: Please insert a valid unix alias.
es: Por favor, ingresar un alias de shell valido.

# msg.actions.internal.save_new_alias.last_command
source: Last command: {last_command}
es: Último comando ejecutado: {last_command}

# msg.actions.internal.save_new_alias.success
source: [green]✓[/green] [u]All done! You can now run your alias like:[/u]
es: ¡Listo! Ya podés ejecutar tu alias de la siguiente manera:

# msg.actions.internal.save_new_alias.reload_builtins
source: [dim]You probably need to reload your shell built-ins.[/dim]
es: [dim]Probablemente necesites refrescar los built-ins de tu shell.[/dim]

# msg.actions.internal.save_new_alias.run_source
source: [dim]Either by running 'source {file_path}' or restarting your terminal.[/dim]
es: [dim]Podes ejecutar 'source {file_path}' o reiniciar tu terminal.[/dim]

# msg.actions.internal.save_new_alias.added_to_file
source: Added alias to {file}
es: Se agrego el alias al archivo {file}

# msg.support.update.cli.checking_for_cli_updates
source: Checking for new CLI versions
es: Verificando si existen actualizaciones de CLI

# msg.support.update.cli.checking_for_cli_updates_on_branch
source: Checking for new CLI versions, on branch: [cyan]{branch}[/cyan]
es: Verificando si existen actualizaciones de CLI, en la rama {branch}

# msg.support.update.cli.new_version_available
source: New [cyan]{cli_name}[/cyan] version available
es: Hay una nueva versión disponible de [cyan]{cli_name}[/cyan]

# action.support.update.cli.confirm_update
source: Would you like to update?
es: ¿Te gustaría actualizar?

# msg.support.update.cli.updated
source: [green]✓[/green] [white]Updated to latest version[/white]
es: [green]✓[/green] [white]Se actualizó a la última versión[/white]

# msg.support.update.hexagon.checking_new_versions
source: Checking for new hexagon versions
es: Verificando si existen nuevas versión de hexagon

# msg.support.update.hexagon.new_version_available
source: New [cyan]hexagon[/cyan] version available [green]{latest_version}[/green]!
es: Nueva versión de [cyan]hexagon[/cyan] disponible [green]{latest_version}[/green]!

# msg.support.update.hexagon.fetching_changelog
source: Fetching changelog
es: Descargando información de cambios

# action.support.update.hexagon.confirm_update
source: Would you like to update?
es: ¿Te gustaría actualizar?

# msg.support.update.hexagon.updating
source: Updating
es: Actualizando

# msg.support.update.hexagon.updated
source: Updated to latest version
es: [green]🗸[/green] Se actualizó a la última versión

# error.domain.configuration.group_tool_file_not_found
source: File {config_file_path} could not be found
es: No se encontró el archivo {config_file_path}

# msg.domain.configuration.install_cli_long_name
source: Install CLI
es: Instalar CLI

# msg.domain.configuration.install_cli_description
source: Install a custom project CLI from a YAML file.
es: Instalar una CLI desde un archivo YAML de configuración.

# msg.domain.configuration.get_json_schema_long_name
source: Get JSON Schema
es: Crear una nueva herramienta

# msg.domain.configuration.get_json_schema_description
source: Generate JSON Schema for hexagon config file (app.yml). Which can be imported in your IDE, or used for validation.
es: Instalar una CLI desde un archivo YAML de configuración.

# msg.domain.configuration.save_alias_long_name
source: Save Last Command as Shell Alias
es: Guardar el último comando ejecutado como shell alias

# msg.domain.configuration.create_tool_long_name
source: Create A New Tool
es: Crear una nueva herramienta

# msg.support.dependencies.installing_dependencies
source: Installing {runtime} dependencies at path: {path}
es: Instalando dependencias de {runtime} en directorio {path}

# msg.support.execute.action.tool_help_epilog
source: To support tool arguments either add a model extending hexagon.domain.args.ToolArgs class to your script, or a args property in the tool YAML definition.
es: Para usar argumentos de CLI agregar a tu script un modelo extendiendo hexagon.domain.args.ToolArgs, o una propiedad `args` a la definición de la tool en el YAML.

# error.support.execute.errors.command_result_code
source: {executed_command} returned code: {return_code}
es: {executed_command} retornó código: {return_code}

# error.support.execute.errors.could_not_execute
source: Hexagon couldn't execute the action: [bold]{action}[/bold]
es: No fue posible ejecutar la acción: [bold]{action}[/bold]

# error.support.execute.errors.we_tried
source: We tried:
es: Intentamos lo siguiente:

# error.support.execute.errors.attempt_cli_custom_dir
source: - Your CLI's custom_tools_dir: [bold]{path}[/bold]
es: - Buscar la acción en tu directorio de herramientas (custom_tools_dir) [bold]{path}[/bold]

# error.support.execute.errors.attempt_internal_tools
source: - Hexagon repository of external actions ({package})
es: - Buscar en el registro interno de acciones de hexagon ({package})

# error.support.execute.errors.attempt_known_script
source: - A known script file ({extensions})
es: - Ejecutar según extensiones conocidas de archivos ({extensions})

# error.support.execute.errors.attempt_inline_command
source: Running your action as a shell command directly
es: - Ejecutando la acción como un comando directamente

# error.support.execute.errors.invalid_input
source: There where {count} error(s) in your input for tool {tool}
es: Hay {count} errores en el input para la herramienta {tool}

# error.support.execute.errors.python_dependency_error
source: Your custom action seems to have a module dependency error
es: Tu acción parece tener un error de dependencias de módulos

# error.support.execute.errors.execute_tool_failed
source: Execution of tool {action} failed
es: La ejecución de {action} falló

# msg.support.execute.tool.go_back_long_name
source: Go back
es: Atrás

# msg.support.execute.tool.go_back_description
source: Go back to the previous menu
es: Volver al menú anterior

# msg.support.help.no_install
source: You are executing Hexagon without an install.
es: Se está ejecutando hexagon directamente.

# msg.support.help.get_started
source: To get started run hexagon's "Install CLI" tool
es: El primer paso suele ser ejecutar la acción "Instalar CLI".

# msg.support.help.envs
source: [bold][u]Envs:[/bold][/u]
es: [bold][u]Entornos:[/bold][/u]

# msg.support.help.tools
source: [bold][u]Tools:[/bold][/u]
es: [bold][u]Herramientas:[/bold][/u]

# error.support.cli.git.failed_to_get_remote
source: Couldn't get the remote name from your cli's repository, too many choices and origin is not present
es: Hubo un error de git accediendo al remote del repositorio de tu CLI, hay varias opciones y origin no está presente.

# action.support.wax.select_environment
source: On which environment?
es: ¿Para qué entorno?

# error.support.wax.invalid_environment
source: Please select a valid environment
es: Por favor, selecciona un entorno valido

# action.support.wax.select_tool
source: Hi, which tool would you like to use today?
es: Hola ¿qué herramienta te gustaría usar hoy?

# error.support.wax.invalid_tool
source: Please select a valid tool
es: Por favor, selecciona una herramienta valida

# error.support.yaml.invalid_yaml
source: There were {errors_length} error(s) in your YAML file: {yaml_path}
es: Hay {errors_length} errores en el YAML: {yaml_path}

# error.support.hooks.hook.unknown_type
source: Unknown HookSubscriptionType {subscription_type}
es: HookSubscriptionType desconocido {subscription_type}

# msg.support.prompt.hints.confirm
source: [ {keys} ] to confirm
es: [ {keys} ] para confirmar

# msg.support.prompt.hints.cancel
source: [ {keys} ] to cancel
es: [ {keys} ] para cancelar

# msg.support.prompt.hints.skip
source: [ {keys} ] to skip
es: [ {keys} ] para saltear

# msg.support.prompt.hints.autocomplete
source: [ {keys} ] to autocomplete (if available)
es: [ {keys} ] para autocompletar (de ser posible)

# msg.support.prompt.hints.toggle
source: [ {keys} ] to toggle
es: [ {keys} ] para alternar selección

# msg.support.prompt.hints.toggle_move_down
source: [ {keys} ] to toggle and move down
es: [ {keys} ] para alternar y mover hacia abajo

# msg.support.prompt.hints.toggle_move_up
source: [ {keys} ] to toggle and move up
es: [ {keys} ] para alternar y mover hacia arriba

# msg.support.prompt.hints.toggle_all
source: [ {keys} ] to toggle all
es: [ {keys} ] para alternar todo

# msg.support.prompt.hints.toggle_all_true
source: [ {keys} ] to toggle all to true
es: [ {keys} ] para seleccionar todo

# msg.support.prompt.hints.move_down
source: [ {keys} ] to move down
es: [ {keys} ] para mover hacia abajo

# msg.support.prompt.hints.move_up
source: [ {keys} ] to move up
es: [ {keys} ] para mover hacia arriba

# msg.support.prompt.hints.toggle_fuzzy_search
source: [ {keys} ] to toggle fuzzy search
es: [ {keys} ] para alternar búsqueda difusa

# msg.support.prompt.hints.number_decrement
source: [ {keys} ] to decrement
es: [ {keys} ] para decrementar

# msg.support.prompt.hints.number_increment
source: [ {keys} ] to increment
es: [ {keys} ] para incrementar

# msg.support.prompt.hints.number_left
source: [ {keys} ] to select number left
es: [ {keys} ] para número a la izquierda

# msg.support.prompt.hints.number_right
source: [ {keys} ] to select number right
es: [ {keys} ] para número a la derecha

# msg.support.prompt.hints.toggle_negative
source: [ {keys} ] to toggle negative
es: [ {keys} ] para alternar positividad

# msg.support.prompt.hints.number_dot
source: [ {keys} ] to select decimal part
es: [ {keys} ] para editar decimal

# msg.support.prompt.hints.alt_part_focus
source: [ {keys} ] to alternate focused part
es: [ {keys} ] para enfocar parte alternativa

# msg.support.prompt.hints.create_path_at_location
source: [ {keys} ] to create directory at location
es: [ {keys} ] para crear directorio en esta ubicación

# error.support.prompt.hints.no_hints_on_builder
source: HintsBuilder should have at least one hint
es: No se configuró HintsBuilder correctamente.

# msg.support.prompt.hints.help
source: help:
es: ayuda:

# error.support.input.prompt.prompt.invalid_argument_setup
source: Config [b]{property}[/b] is not supported for argument [b]{argument}[/b]
es: Configuración {property} no es válida para argumento {argument}

# msg.support.prompt.prompt.directory_created
source: 📁 created directory: {path} [green]✓[/green]
es: 📁 directorio creado: {path} [green]✓[/green]

# msg.main.tracer.run_again
source: [cyan][dim]To run this tool again do:[/dim] {command}[/cyan]
es: [cyan][dim]Para ejecutar nuevamente:[/dim] {command}[/cyan]

# msg.main.tracer.or
source: [cyan][dim] or:[/dim] {command}[/cyan]
es: [cyan][dim] o:[/dim] {command}[/cyan]
